app/Controllers/AuthController.php

UPDATE `users` SET `last_login` = '2023-12-07 14:55:54', `updated_at` = '2023-12-07 14:55:54'
WHERE `id` = '1'
---
    public function index()
    {
        // Obtener credenciales de la solicitud
        $phone      = $this->request->getVar('phone');
        $password   = $this->request->getVar('password');

        // Validar credenciales y obtener usuario
        $user       = $this->validateCredentialsAndGetUser($phone, $password);
        if (is_null($user)) {
            return $this->respond(['error' => 'Invalid phone or password.'], 401);
        }

        // Actualizar last_login
        $this->updateLastLogin($user['id']);

SELECT *
FROM `users`
WHERE `phone` = '551111111'
AND `users`.`deleted_at` IS NULL
 LIMIT 1
---
    private function validateCredentialsAndGetUser($phone, $password)
    {
        $userModel = new UserModel();
        $user = $userModel->where('phone', $phone)->first();

UPDATE `users` SET `last_login` = '2023-12-07 15:35:47', `updated_at` = '2023-12-07 15:35:47'
WHERE `id` = '1'
---
    private function updateLastLogin($userId)
    {
        $userModel = new UserModel();
        $userModel->set('last_login', date('Y-m-d H:i:s'))->where('id', $userId)->update();

SELECT `permissions`
FROM `catusertypes`
WHERE `user_type` = 'user'
 LIMIT 1
---
    private function getUserPermissions($userType)
    {
        $catUserTypeModel = new CatUserTypeModel();
        $permissionsData = $catUserTypeModel->select('permissions')->where('user_type', $userType)->first();