app/Controllers/UserController.php

SELECT `name`, `last_name`, `phone`, `email`, `picture`, `id_user_type`, `created_at`, `updated_at`, `last_login`
FROM `users`
WHERE `users`.`deleted_at` IS NULL
---
    private function getAllUsers(): array
    {
        $usersModel = new UserModel();
        return $usersModel->select("name,last_name,phone,email,picture,id_user_type,created_at,updated_at,last_login")->findAll();

INSERT INTO `users` (`name`, `last_name`, `phone`, `email`, `password`, `picture`, `id_user_type`, `created_at`, `updated_at`) VALUES ('Pedro', 'Hernandez', '551111117', 'ing.ede@gmail.com', '$2y$10$pGmr.L5cfOJHkOHh/1hDJeOLWZqr6EgBZUO8RH/JD4cJmwnMz4Lxu', '/images/1701985372.png', 'user', '2023-12-07 15:42:52', '2023-12-07 15:42:52')
---
    private function processAndSaveUserData()
    {
        // Validar y mover la imagen, obtener el nombre del archivo
        $image_name = $this->validateImage($this->request->getFile('picture'));

        // Crear modelo y datos del usuario
        $model = new UserModel();
        $data = [
            'name'          => $this->request->getPost('name'),
            'last_name'     => $this->request->getPost('last_name'),
            'phone'         => $this->request->getPost('phone'),
            'email'         => $this->request->getPost('email'),
            'password'      => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
            'picture'       => $image_name,
            'id_user_type'  => $this->request->getPost('id_user_type'),
        ];

        // Guardar datos del usuario en la base de datos
        $model->save($data);